app/controllers/admin/albums_controller.rb

  def index
    @albums =  Album.paginate(:order => "position ASC",:page => params[:page], :per_page => per_page)
---
SELECT * FROM "albums" ORDER BY position ASC LIMIT 30 OFFSET 0

  def create
    @album = Album.new(params[:album])
    @album.tag_list = params[:tags]

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("position", "created_at", "title", "updated_at", "description") VALUES(1, '2011-05-17 00:36:23', 'A', '2011-05-17 00:36:23', 'A')
INSERT INTO "tags" ("name") VALUES('featured')

  def uploader
    @photo = Photo.new
    @photo.picture = params[:file]
    @photo.album = @album
    @photo.save
---
INSERT INTO "photos" ("position", "created_at", "title", "album_id", "updated_at", "picture_content_type", "picture_updated_at", "picture_file_name", "picture_file_size", "cover_id", "description") VALUES(1, '2011-05-17 00:36:29', NULL, 1, '2011-05-17 00:36:29', 'application/octet-stream', '2011-05-17 00:36:29', 'image001.jpg', 175761, NULL, NULL)

  def set_cover
    @album.cover = Photo.find(params[:photo_id])
    @album.save
---
SELECT * FROM "photos" WHERE ("photos".album_id = 1) ORDER BY position LIMIT 1
UPDATE "photos" SET "updated_at" = '2011-05-17 00:52:08', "picture_content_type" = 'application/octet-stream', "created_at" = '2011-05-17 00:52:08', "picture_file_size" = 74165, "album_id" = 1, "picture_file_name" = 'Screen_20shot_202011-05-11_20at_2010.52.12_20AM.png', "position" = 7, "cover_id" = 1, "picture_updated_at" = '2011-05-17 00:52:08' WHERE "id" = 7

  def find_album
    @album = Album.find(params[:id]) unless params[:id].nil?
---
SELECT * FROM "albums" WHERE (1 = 1) ORDER BY position DESC LIMIT 1