app/controllers/admin/articles_controller.rb

SELECT * FROM "articles" LIMIT 30 OFFSET 0
---
  def index
     @articles = Article.paginate(:page => params[:page], :per_page => per_page, :order => "created_at DESC")