app/controllers/admin/downloads_controller.rb

  def index
    @featured =  Download.tagged_with("featured").paginate(:page => params[:page], :per_page => per_page)
---
SELECT * FROM "downloads" WHERE (1 = 0) LIMIT 30 OFFSET 0
SELECT * FROM "tags" WHERE (name LIKE 'featured')