app/controllers/admin/events_controller.rb

  def index
    @events =  Event.paginate(:page => params[:page], :per_page => per_page)
---
SELECT * FROM "events" ORDER BY date DESC