app/controllers/admin/features_controller.rb

SELECT * FROM "features" WHERE (1 = 1) ORDER BY position DESC LIMIT 1
---
  def index
    @features =  Feature.paginate(:order => "position ASC",:page => params[:page], :per_page => per_page)

DELETE FROM "features" WHERE "id" = 1
---
  def destroy
    @feature.destroy

INSERT INTO "features" ("position", "created_at", "title", "picture_content_type", "updated_at", "title_top", "picture_updated_at", "picture_file_name", "picture_file_size", "tag_line", "summary", "link") VALUES(1, '2011-05-17 00:07:49', 'Critical', 'image/png', '2011-05-17 00:07:49', NULL, '2011-05-17 00:07:49', 'Screen_shot_2011-05-11_at_10.52.12_AM.png', 40372, 'Crit', 'AAAA', '')
---
  def create
    @feature = Feature.new(params[:feature])

    respond_to do |format|
      if @feature.save

SELECT * FROM "features" WHERE (1 = 1) ORDER BY position DESC LIMIT 1
---
  def find_feature
    @feature = Feature.find(params[:id]) unless params[:id].nil?