app/controllers/admin/tickers_controller.rb

SELECT * FROM "tickers" ORDER BY position ASC LIMIT 30 OFFSET 0
---
  def index
     @tickers = Ticker.paginate(:order => "position ASC", :page => params[:page], :per_page => per_page)