app/controllers/albums_controller.rb

SELECT * FROM "albums" WHERE (1 = 0)
SELECT "albums".* FROM "albums" JOIN taggings albums_taggings_featured_978 ON albums_taggings_featured_978.taggable_id = albums.id AND albums_taggings_featured_978.taggable_type = 'Album' AND albums_taggings_featured_978.tag_id = 1
SELECT * FROM "tags" WHERE (name LIKE 'featured')
---
  def index
    @features = Feature.find(:all, :limit => 7, :order => 'position ASC')
    @albums = []
    if params[:filter] == "search"
      search_condition = "%" + params[:query] + "%"
      @albums = Album.find(:all, :conditions => ['title LIKE ? OR description LIKE ?', search_condition, search_condition])
    else
      @albums = Album.tagged_with(params[:filter]).all

SELECT * FROM "albums" WHERE ("albums"."id" = 1)
---
  def show
    @album = Album.find(params[:id])

SELECT * FROM "albums" WHERE ("albums"."id" = 1)
---
  def slide
    @features = Feature.find(:all, :limit => 7, :order => 'position ASC')
    @album = Album.find(params[:id])