app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
    @topic = @article.topic
    @posts = @topic.posts.paginate :per_page => 10, :page => params[:page], :include => :user
---
SELECT * FROM "articles" WHERE ("articles"."id" = 2)
SELECT * FROM "posts" WHERE ("posts".topic_id = 3) LIMIT 10 OFFSET 0
SELECT * FROM "topics" WHERE ("topics".article_id = 2) ORDER BY sticky desc LIMIT 1