app/controllers/tvs_controller.rb

  def index
    @features = Feature.find(:all, :limit => 5)
    params[:game] ||= ""
    params[:filter] ||= "featured"
    @live = Tv.tagged_with("special_live").first
---
SELECT * FROM "tags" WHERE (name LIKE 'special_live')